<?php

/*
 * @author  :  TVC97
 * @email   :  tvc208@gmail.com
 * @website :  http://mbvn.tk/
 */

class Encoding {

    public static function to_unicode($str) {

        $uni_com = array(
            'ầ', 'ấ', 'ậ', 'ẩ', 'ẫ', 'à', 'á', 'ạ', 'ả', 'ã', 'â', 'ằ', 'ắ', 'ặ', 'ẳ', 'ẵ', 'ă',
            'ề', 'ế', 'ệ', 'ể', 'ễ', 'è', 'é', 'ẹ', 'ẻ', 'ẽ', 'ê',
            'ì', 'í', 'ị', 'ỉ', 'ĩ',
            'ồ', 'ố', 'ộ', 'ổ', 'ỗ', 'ò', 'ó', 'ọ', 'ỏ', 'õ', 'ô', 'ờ', 'ớ', 'ợ', 'ở', 'ỡ', 'ơ',
            'ù', 'ú', 'ụ', 'ủ', 'ũ', 'ừ', 'ứ', 'ự', 'ử', 'ữ', 'ư',
            'ỳ', 'ý', 'ỵ', 'ỷ', 'ỹ',
            'đ',
            'Ầ', 'Ấ', 'Ậ', 'Ẩ', 'Ẫ', 'À', 'Á', 'Ạ', 'Ả', 'Ã', 'Â', 'Ằ', 'Ắ', 'Ặ', 'Ẳ', 'Ẵ', 'Ă',
            'Ề', 'Ế', 'Ệ', 'Ể', 'Ễ', 'È', 'É', 'Ẹ', 'Ẻ', 'Ẽ', 'Ê',
            'Ì', 'Í', 'Ị', 'Ỉ', 'Ĩ',
            'Ồ', 'Ố', 'Ộ', 'Ổ', 'Ỗ', 'Ò', 'Ó', 'Ọ', 'Ỏ', 'Õ', 'Ô', 'Ờ', 'Ớ', 'Ợ', 'Ở', 'Ỡ', 'Ơ',
            'Ù', 'Ú', 'Ụ', 'Ủ', 'Ũ', 'Ừ', 'Ứ', 'Ự', 'Ử', 'Ữ', 'Ư',
            'Ỳ', 'Ý', 'Ỵ', 'Ỷ', 'Ỹ',
            'Đ'
        );
        $unicode = array(
            'ầ', 'ấ', 'ậ', 'ẩ', 'ẫ', 'à', 'á', 'ạ', 'ả', 'ã', 'â', 'ằ', 'ắ', 'ặ', 'ẳ', 'ẵ', 'ă',
            'ề', 'ế', 'ệ', 'ể', 'ễ', 'è', 'é', 'ẹ', 'ẻ', 'ẽ', 'ê',
            'ì', 'í', 'ị', 'ỉ', 'ĩ',
            'ồ', 'ố', 'ộ', 'ổ', 'ỗ', 'ò', 'ó', 'ọ', 'ỏ', 'õ', 'ô', 'ờ', 'ớ', 'ợ', 'ở', 'ỡ', 'ơ',
            'ù', 'ú', 'ụ', 'ủ', 'ũ', 'ừ', 'ứ', 'ự', 'ử', 'ữ', 'ư',
            'ỳ', 'ý', 'ỵ', 'ỷ', 'ỹ',
            'đ',
            'Ầ', 'Ấ', 'Ậ', 'Ẩ', 'Ẫ', 'À', 'Á', 'Ạ', 'Ả', 'Ã', 'Â', 'Ằ', 'Ắ', 'Ặ', 'Ẳ', 'Ẵ', 'Ă',
            'Ề', 'Ế', 'Ệ', 'Ể', 'Ễ', 'È', 'É', 'Ẹ', 'Ẻ', 'Ẽ', 'Ê',
            'Ì', 'Í', 'Ị', 'Ỉ', 'Ĩ',
            'Ồ', 'Ố', 'Ộ', 'Ổ', 'Ỗ', 'Ò', 'Ó', 'Ọ', 'Ỏ', 'Õ', 'Ô', 'Ờ', 'Ớ', 'Ợ', 'Ở', 'Ỡ', 'Ơ',
            'Ù', 'Ú', 'Ụ', 'Ủ', 'Ũ', 'Ừ', 'Ứ', 'Ự', 'Ử', 'Ữ', 'Ư',
            'Ỳ', 'Ý', 'Ỵ', 'Ỷ', 'Ỹ',
            'Đ'
        );
        return str_replace($uni_com, $unicode, $str);
    }
}